tutorials/reactiveTransport/reactive_BC/constant/reactionDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      reactionDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

//              k*prod(C_i^exponents_i)
// r = ------------------------------------------------
//     {1+sum[(Ks_i*C_i)^exponentsS_i]}^exponentsS_total


zoneName    none;   // Name of the cellsZone where the reaction occurs. You can e "all" to consider all cells

reactions
(

);