tutorials/reactiveTransport/reactive_BC/constant/speciesDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      speciesDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
species
(

    Cg
    {
        D          D [0 2 -1 0 0 0 0] 1e-2;
    }

    Ch
    {
        D          D [0 2 -1 0 0 0 0] 1e-2;
    }

    Cp
    {
        D          D [0 2 -1 0 0 0 0] 1e-2;
    }
);